# Mid EXAM : Tools and Techniques Data Science

# Task 1: ( 5 Marks)  Warp up

# Note : Rename the file with your name and id and also mention your name and id inside here

Name: _______UZAIR IFTIKHAR___________                                ID: F2022393007

In [134]:
# Q1. Here, we take each element in the list a (temporarily assigning it the value i) 
a = [5, 10, 15, 20]

In [135]:
# (i)	Find the square each element in the list. This creates a new list called b and does not modify a through data comprehension.

In [136]:
import numpy as np
b=np.square(a)
b.tolist()

[25, 100, 225, 400]

In [137]:
# (ii)	Write a conditional statement of only squaring the elements if the element is not equal to 10.

In [138]:
listNew = []

for i in a:
  if i!=10:
    listNew.append(i*i)

print(listNew)

[25, 225, 400]

In [139]:
# Q2. (i) Write the command of random samples from a uniform distribution between 0 and 1?

In [140]:
import numpy as np

In [169]:
np.random.uniform(low = 0.0, high = 1.0, size = 15)

array([0.28893971, 0.8801092 , 0.11062508, 0.55576796, 0.06971142,
       0.7257522 , 0.36263591, 0.2146138 , 0.08370001, 0.02918963,
       0.11957854, 0.31826337, 0.72013098, 0.14115862, 0.228424  ])

In [142]:
#(ii)	Write the command to slice the column 1?

In [143]:
import pandas as pd
A = {
    'Subjects':["OOP","PF","AI"],
    'Fee' :[20000,25000,30000],
    'Duration':['30days','40days','50days'],
    'Discount':[1000,2300,5000],'Timing':['Mor','Eve','Mor']
              }
df = pd.DataFrame(A)
df

  Subjects    Fee Duration  Discount Timing
0      OOP  20000   30days      1000    Mor
1       PF  25000   40days      2300    Eve
2       AI  30000   50days      5000    Mor

In [144]:
df2 = df.iloc[:,:1]
print(df2)

  Subjects
0      OOP
1       PF
2       AI

In [145]:
#(iii)	Write the command of first and third elements in column 1?

In [146]:
df.iloc[1:3,:1]

  Subjects
1       PF
2       AI

In [147]:
#(iv)	 Write the command of returns an 8 x 4 array

In [148]:
arr = np.empty((8, 4))
for i in range(8):
   arr[i] = i
arr

array([[0., 0., 0., 0.],
       [1., 1., 1., 1.],
       [2., 2., 2., 2.],
       [3., 3., 3., 3.],
       [4., 4., 4., 4.],
       [5., 5., 5., 5.],
       [6., 6., 6., 6.],
       [7., 7., 7., 7.]])

In [149]:
import pandas as pd

In [150]:
#Q3. Create a Series that looks like this below:
Flour     4 cups
Milk       1 cup
Eggs     2 large
Spam       1 can
Name: Dinner, dtype: object

SyntaxError: invalid syntax (4174055471.py, line 2)

In [151]:
B = pd.Series(['4 cups','1 cup','2 large','1 can'],index = ['Flour','Milk','Eggs','Spam'])
B

Flour     4 cups
Milk       1 cup
Eggs     2 large
Spam       1 can
dtype: object

In [152]:
# Q  4 Create the Data frame  as th output[27]

In [153]:
df= pd.DataFrame({
     'Apples' :[35,41],
    'Bananas':[21,34] }, index = ['2017Sales','2018Sales'])
df

           Apples  Bananas
2017Sales      35       21
2018Sales      41       34

In [154]:
df

           Apples  Bananas
2017Sales      35       21
2018Sales      41       34

In [155]:
#Q4. create Dataframe then find imputation for these missing NaN in the out[47]

In [156]:
df = pd.DataFrame({'Age':[23.0,39.0,45.0,np.NaN],'Gender':['M','F','F','M'],'Income':[24200.0,np.NaN,45390.0,np.NaN],'Religion':['Muslim','chirstian',np.NaN,'Muslim']})
df

    Age Gender   Income   Religion
0  23.0      M  24200.0     Muslim
1  39.0      F      NaN  chirstian
2  45.0      F  45390.0        NaN
3   NaN      M      NaN     Muslim

In [157]:
df

    Age Gender   Income   Religion
0  23.0      M  24200.0     Muslim
1  39.0      F      NaN  chirstian
2  45.0      F  45390.0        NaN
3   NaN      M      NaN     Muslim

In [158]:
#Q4(i)	Compute the appropriate missing value in income attribute?

In [159]:
df['Income'].fillna(df['Income'].mean(), inplace=False)

0    24200.0
1    34795.0
2    45390.0
3    34795.0
Name: Income, dtype: float64

In [160]:
#(ii)	Compute the appropriate missing values in religion attribute?

In [161]:
df['Religion'].fillna(df['Religion'].mode()[0], inplace=False)

0       Muslim
1    chirstian
2       Muslim
3       Muslim
Name: Religion, dtype: object

In [162]:
#(iii)	Drop the columns where any of the elements is nan

In [167]:
df.drop(['Age','Income','Religion'], inplace=False, axis=1)

  Gender
0      M
1      F
2      F
3      M

In [164]:
#(iv)	Keep only the rows with at least 2 non-na values

In [168]:
df.dropna(thresh=2, inplace=False)

    Age Gender   Income   Religion
0  23.0      M  24200.0     Muslim
1  39.0      F      NaN  chirstian
2  45.0      F  45390.0        NaN
3   NaN      M      NaN     Muslim